# დიქშენარი:

# 1.შექმენი სტუდენტების ქულების დიქშენარი (სახელი → ქულა) და იპოვე რომელი სტუდენტი მიიღო ყველაზე მაღალი ქულა.
# 2.დაწერე პროგრამა, სადაც დიქშენარში შენახულია პროდუქტების ფასები და დათვალე ჯამური ფასი.
# 3.გქონდეს დიქშენარი წიგნების შესახებ (სათაური → ავტორი) და მოძებნე რომელ ავტორს ეკუთვნის კონკრეტული წიგნი.

# სეტი:
# 1.დაწერე პროგრამა, სადაც მომხმარებელი შეიყვანს რამდენიმე სიტყვას და შენ უნდა შეინახო მხოლოდ უნიკალური სიტყვები სეტში.
# 2.შექმენი სეტი რიცხვებით 1-დან 10-მდე და ამოიღე ყველა ლუწი რიცხვი და ჩასვი სეტში რომელსაც ლისტად გადააქცევთ list ფუნქციის დახმარებით
# 3.გაქვს სია მოსწავლეების ID-ებით. გადააქციე სეტად და შეამოწმე არის თუ არა ორჯერ შემოსული ერთი და იგივე ID

students_scores = {
    "გიორგი": 85,
    "ნინო": 92,
    "ლაშა": 78,
    "მარიამი": 95,
    "დათო": 88
}

best = max(students_scores, key=students_scores.get)
print(best, students_scores[best])



productprice = {
    "პური": 1.2,
    "რძე": 2.5,
    "ყველი": 5.0,
    "კვერცხი": 3.0
}

total_price = sum(productprice.values())
print(f"პროდუქტების ჯამური ფასი: {total_price} ლარი")

books = {"ოსტატი და მარგარიტა": "მიხაილ ბულგაკოვი", 
         "დედა": "მაქსიმ გორკი", 
         "ვეფხისტყაოსანი": "შოთა რუსთაველი", 
         "კაპიტან გრანტის შვილები": "ჟიულ ვერნი"
         }
print(f"წიგნის 'ვეფხისტყაოსანი' ავტორია: {books.get('ვეფხისტყაოსანი','ავტორი ვერ მოიძებნა')}")